## Join and merge pandas

In [2]:
import pandas as pd

- merge = It is used to combine dataframes for common columns.
- join = It is used to combine dataframes for columns.
- To merge the dataframes we use "on" and "how".
- On = columns name should be in both dataframes
- how = Type of joins:
    - left join
    - right join
    - inner join
    - outer join

In [3]:
data={'student_name':(['renu','venu','mahi','abhi','hari']),
     'english':([91,98,92,94,93]),
     'student_age':([9,10,14,12,15])}
data1=pd.DataFrame(data)
data1

  student_name  english  student_age
0         renu       91            9
1         venu       98           10
2         mahi       92           14
3         abhi       94           12
4         hari       93           15

In [4]:
data={'student_name':(['renu','venu','teju']),
     'english':([95,94,92]),
     'student_id':([1024,1042,1062])}
data2=pd.DataFrame(data)
data2

  student_name  english  student_id
0         renu       95        1024
1         venu       94        1042
2         teju       92        1062

## Left join

- left data frame will not change.
- right data frame will come and stick to respective rows based on "on" columun.

In [4]:
left_join=pd.merge(data1,data2,on="student_name",how="left")
left_join

  student_name  maths  student_age  english  student_id
0         renu     91            9     95.0      1024.0
1         venu     98           10     94.0      1042.0
2         mahi     92           14      NaN         NaN
3         abhi     94           12      NaN         NaN
4         hari     93           15      NaN         NaN

In [5]:
left_join=pd.merge(data2,data1,on="student_name",how="left")
left_join

  student_name  english  student_id  maths  student_age
0         renu       95        1024   91.0          9.0
1         venu       94        1042   98.0         10.0
2         teju       92        1062    NaN          NaN

In [6]:
data={'student_name':(['renu','venu','venu']),
     'english':([95,94,92]),
     'student_id':([1024,1042,1062])}
data2=pd.DataFrame(data)
data2

  student_name  english  student_id
0         renu       95        1024
1         venu       94        1042
2         venu       92        1062

In [7]:
left_join=pd.merge(data1,data2,on="student_name",how="left")
left_join

  student_name  maths  student_age  english  student_id
0         renu     91            9     95.0      1024.0
1         venu     98           10     94.0      1042.0
2         venu     98           10     92.0      1062.0
3         mahi     92           14      NaN         NaN
4         abhi     94           12      NaN         NaN
5         hari     93           15      NaN         NaN

## inner join

- Inner join gives that both dataframes which have same on given column.

In [8]:
inner_join=pd.merge(data1,data2,on="student_name",how="inner")
inner_join

  student_name  maths  student_age  english  student_id
0         renu     91            9       95        1024
1         venu     98           10       94        1042
2         venu     98           10       92        1062

## Outer join

- Outer join gives total dataframe of data1 and data2,according to given column

In [9]:
outer_join=pd.merge(data1,data2,on="student_name",how="outer")
outer_join

  student_name  maths  student_age  english  student_id
0         renu     91            9     95.0      1024.0
1         venu     98           10     94.0      1042.0
2         venu     98           10     92.0      1062.0
3         mahi     92           14      NaN         NaN
4         abhi     94           12      NaN         NaN
5         hari     93           15      NaN         NaN

rest_type | rest_location | percentage  - df1
rest_type | rest_location | count  - df2 

df1 < df2 = s